yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/pinmux/inc/rtl_pinmux.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_PINMUX_H
#define RTL_PINMUX_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "pinmux/src/rtl87x2g/rtl_pinmux_def.h"
#include "pinmux/src/rtl87x2g/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "pinmux/src/rtl87x3e/rtl_pinmux_def.h"
#include "pinmux/src/rtl87x3e/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "pinmux/src/rtl87x3d/rtl_pinmux_def.h"
#include "pinmux/src/rtl87x3d/pin_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "pinmux/src/rtl87x2j/rtl_pinmux_def.h"
#include "pinmux/src/rtl87x2j/pin_def.h"
#endif

/** \defgroup PINMUX      PINMUX
  * \brief
  * \{
  */

/*============================================================================*
 *                         Macros
 *============================================================================*/

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup PINMUX_Exported_Constants PINMUX Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    PAD_Power_Mode PAD Power Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_NOT_PWRON,     //!< Disable pad power mode.
    PAD_IS_PWRON = 1   //!< Enable pad power mode.
} PADPowerMode_TypeDef;

/** End of PAD_Power_Mode
  * \}
  */

/**
 * \defgroup    PAD_Output_Config PAD Output Config
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_OUT_DISABLE,   //!< Disable pad output.
    PAD_OUT_ENABLE     //!< Enable pad output.
} PADOutputMode_TypeDef;

/** End of PAD_Output_Config
  * \}
  */

/**
 * \defgroup    PAD_Output_Value PAD Output Value
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_OUT_LOW,     //!< The pad outputs a low level.
    PAD_OUT_HIGH     //!< The pad outputs a high level.
} PADOutputValue_TypeDef;

/** End of PAD_Output_Value
  * \}
  */

/**
 * \defgroup    PAD_Pull_Mode PAD Pull Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_PULL_DOWN,     //!< Enable the pull-down resistor function for the pad.
    PAD_PULL_UP,       //!< Enable the pull-up resistor function for the pad.
    PAD_PULL_NONE,     //!< Pad is in a floating state.
} PADPullMode_TypeDef;

/** End of PAD_Pull_Mode
  * \}
  */

/**
 * \defgroup    PAD_Pull_Strength_Mode PAD Pull Strength Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_PULL_WEAK,       //!< PAD pull mode is weak pull mode.
    PAD_PULL_STRONG,     //!< PAD pull mode is srtong pull mode.
} PADPullStrengthMode_TypeDef;

/** End of PAD_Pull_Strength_Mode
  * \}
  */

/**
 * \defgroup    PAD_Driving_Current_Value PAD Driving Current Value
 * \{
 * \ingroup     PINMUX_Exported_Constants
 * \brief       Detailed  level and current relationship refers to \ref PAD_Constant_Wrapper.
 */
typedef enum
{
    LEVEL0,   //!< The PAD driving current is set to level 0.
    LEVEL2,   //!< The PAD driving current is set to level 2.
#if (PAD_DRIVING_CURRENT_LEVEL == 4)
    LEVEL1,   //!< The PAD driving current is set to level 1.
    LEVEL3,   //!< The PAD driving current is set to level 3.
#endif
} PADDrivingCurrent_TypeDef;

/** End of PAD_Driving_Current_Value
  * \}
  */

/**
 * \defgroup    PAD_WakeUp_Debounce PAD WakeUp Debounce
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_WAKEUP_DEB_DISABLE,   //!< Disable pad wakeup debounce function.
    PAD_WAKEUP_DEB_ENABLE     //!< Enable pad wakeup debounce function.
} PADWakeupDebCmd_TypeDef;

/** End of PAD_WakeUp_Debounce
  * \}
  */

/**
 * \defgroup    PAD_WakeUp PAD WakeUp
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_WAKEUP_DISABLE,    //!< Disable PAD wakeup function.
    PAD_WAKEUP_ENABLE      //!< Enable PAD wakeup function.
} PADWakeupCmd_TypeDef;

/** End of PAD_WakeUp
  * \}
  */

/**
 * \defgroup    PAD_Short_Pulse_WakeUp PAD Short Pulse WakeUp
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_SHORT_PULSE_WAKEUP_DISABLE,    //!< Disable PAD short pulse wakeup function.
    PAD_SHORT_PULSE_WAKEUP_ENABLE      //!< Enable PAD short pulse wakeup function.
} PADSPWakeupCmd_TypeDef;

/** End of PAD_Short_Pulse_WakeUp
  * \}
  */

/**
 * \defgroup    PAD_WakeUp_Polarity PAD WakeUp Polarity
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_WAKEUP_POL_HIGH,    //!< PAD wakeup polarity is high.
    PAD_WAKEUP_POL_LOW,     //!< PAD wakeup polarity is low.
    PAD_WAKEUP_NONE         //!< PAD wakeup polarity is none.
} PADWakeupPolarity_TypeDef;

/** End of PAD_WakeUp_Polarity
  * \}
  */

/**
 * \defgroup    PAD_Debounce_Frequency PAD Debounce Frequency
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_DEB_FREQ_32KHz,         //!< The frequency of PAD debounce is 32kHz.
    PAD_DEB_FREQ_16KHz,         //!< The frequency of PAD debounce is 16kHz.
    PAD_DEB_FREQ_8KHz = 3,      //!< The frequency of PAD debounce is 8kHz.
    PAD_DEB_FREQ_4KHz = 7,      //!< The frequency of PAD debounce is 4kHz.
    PAD_DEB_FREQ_2KHz = 15,     //!< The frequency of PAD debounce is 2kHz.
    PAD_DEB_FREQ_1KHz = 31,     //!< The frequency of PAD debounce is 1kHz.
    PAD_DEB_FREQ_500Hz = 63,    //!< The frequency of PAD debounce is 500Hz.
} PADWakeupDebFreq_TypeDef;

/** End of PAD_Debounce_Frequency
  * \}
  */

/**
 * \defgroup    PAD_Mode PAD_Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum
{
    PAD_SW_MODE,            //!< PAD pin is configured in software mode.
#if PAD_SUPPORT_MULTI_CORE
    PAD_V1_PINMUX_MODE,     //!< PAD pin is configured in vcore1 pinmux mode.
    PAD_V2_V4_PINMUX_MODE,  //!< PAD pin is configured in Vcore2&4 pinmux mode.
    PAD_V3_PINMUX_MODE,     //!< PAD pin is configured in Vcore3 pinmux mode.
    PAD_PINMUX_MODE = PAD_V2_V4_PINMUX_MODE, //!< PAD pins are configured in pinmux mode.
#elif PAD_SUPPORT_PON_DOMAIN
    PAD_PON_MODE,          //!< PAD pin is configured in pon domain mode.
    PAD_PINMUX_MODE,       //!< PAD pin is configured in pinmux mode.
#else
    PAD_PINMUX_MODE,       //!< PAD pin is configured in pinmux mode.
#endif
} PADMode_TypeDef;

/** End of PAD_Mode
  * \}
  */

