yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/pinmux/inc/rtl_pinmux.h
#if PAD_SUPPORT_SLEEP_LED
/**
 * \defgroup    Sleep_LED_Pin Sleep LED Pin
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _SLEEP_LED_PIN
{
    SLEEP_LED_ADC_0,
    SLEEP_LED_ADC_1,
    SLEEP_LED_ADC_6,
    SLEEP_LED_ADC_7,
    SLEEP_LED_P1_0,
    SLEEP_LED_P1_1,
    SLEEP_LED_P1_4,
    SLEEP_LED_P2_0,
    SLEEP_LED_P2_1,
    SLEEP_LED_P2_2,
} SLEEP_LED_PIN;

/** End of Sleep_LED_Pin
  * \}
  */
#endif

#if PAD_SUPPORT_FUNCTION_CONFIG
/**
 * \defgroup    PAD_Function_Config PAD Function Config
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _PAD_FUNCTION_CONFIG_VALUE
{
    AON_GPIO,
    LED0,
    LED1,
    LED2,
    CLK_REQ,
    EXTRN_SWR_POW_SWR,
    EXTRN_LDO1_POW_LDO,
    EXTRN_LDO2_POW_LDO,
    PAD_FUNC_MAX,
} PAD_FUNCTION_CONFIG_VAL;

/** End of PAD_Function_Config
  * \}
  */
#endif

#if PAD_SUPPORT_GET_POWER_GROUP
/**
 * \defgroup    PAD_Power_Group PAD Power Group
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _PIN_POWER_GROUP
{
    INVALID_PIN_GROUP  = 0,      //!< Invalid pad power group.
    VDDIO1             = 1,      //!< Pad power group of VDDIO1 pin.
    VDDIO2             = 2,      //!< Pad power group of VDDIO2 pin.
    VDDIO3             = 3,      //!< Pad power group of VDDIO3 pin.
    VDDIO4             = 4,      //!< Pad power group of VDDIO4 pin.
    VDDIO5             = 5,      //!< Pad power group of VDDIO5 pin.
    VCODEC             = 6,      //!< Pad power group of VCODEC pin.
    GROUP_ADC          = 7,      //!< Pad power group of ADC pin.
} T_PIN_POWER_GROUP;

/** End of PAD_Power_Group
  * \}
  */
#endif

#if PAD_SUPPORT_ANALOG_MODE
/**
 * \defgroup    Pad_ANA_Mode Pad ANA Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _ANA_MODE
{
    PAD_ANALOG_MODE,      //!< Config Hybrid pad analog function.
    PAD_DIGITAL_MODE,     //!< Config Hybrid pad digital function.
} ANA_MODE;

/** End of Pad_ANA_Mode
  * \}
  */
#endif

#if (PAD_SUPPORT_ADPATER_WAKEUP | PAD_SUPPORT_MFB_WAKEUP)

/**
 * \defgroup    WakeUp_EN_Mode WakeUp EN Mode
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _WAKEUP_EN_MODE
{
    ADP_MODE,    //!< Wake up by adapter.
    BAT_MODE,    //!< Wake up by battery.
    MFB_MODE     //!< Wake up by MFB.
} WAKEUP_EN_MODE;

/** End of WakeUp_EN_Mode
  * \}
  */

/**
 * \defgroup    WakeUp_Polarity WakeUp Polarity
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _WAKEUP_POL
{
    POL_HIGH,    //!< PAD high-level trigger wakeup.
    POL_LOW,     //!< PAD low-level trigger wakeup.
} WAKEUP_POL;

/** End of WakeUp_Polarity
  * \}
  */
#endif

#if PAD_SUPPORT_GET_OUTPUT_CTRL
/**
 * \defgroup    PAD_AON_Status PAD AON Status
 * \{
 * \ingroup     PINMUX_Exported_Constants
 */
typedef enum _PAD_AON_Status
{
    PAD_AON_OUTPUT_LOW,        //!< Pad AON output low level.
    PAD_AON_OUTPUT_HIGH,       //!< Pad AON output high level.
    PAD_AON_OUTPUT_DISABLE,    //!< Pad AON output disable.
    PAD_AON_PINMUX_ON,         //!< Pad AON pinmux on.
    PAD_AON_PIN_ERR            //!< Pad AON pin error.
} PAD_AON_Status;

/** End of PAD_AON_Status
  * \}
  */
#endif

/** End of PINMUX_Exported_Constants
  * \}
  */


/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    PINMUX_Exported_Functions PINMUX Exported Functions
 * \{
 * \ingroup     PINMUX
 */

/**
 * \brief   Configure or reset all pins to idle mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)//XXX represents the name of the peripheral to be configured.
 * {
 *     Pinmux_Reset();
 * }
 * \endcode
 */
void Pinmux_Reset(void);

/**
 * \brief     Configure the specified pin to idle mode.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pinmux_Deinit(P2_2);
 * }
 * \endcode
 */
void Pinmux_Deinit(uint8_t Pin_Num);

#if PAD_SUPPORT_MULTI_CORE
/**
 * \brief  Deinit the VCORE1 IO function of one pin.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pinmux_V1_Deinit(P2_2);
 * }
  * \endcode
  */
void Pinmux_V1_Deinit(uint8_t Pin_Num);

/**
 * \brief  Deinit the VCORE3 IO function of one pin.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pinmux_CODEC_Deinit(P2_2);
 * }
  * \endcode
  */
void Pinmux_CODEC_Deinit(uint8_t Pin_Num);
#endif

/**
 * \brief     Configure the specified pin to its corresponding IO function.
 *
 * \param[in] Pin_Num   Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] Pin_Func  IO function of pin. Refer to \ref PIN_Function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     Pad_Config(P2_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);
 *     Pad_Config(P2_1, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);

 *     Pinmux_Config(P2_0, UART0_TX);
 *     Pinmux_Config(P2_1, UART0_RX);
 * }
 * \endcode
 */
void Pinmux_Config(uint8_t Pin_Num, uint8_t Pin_Func);

#if PAD_SUPPORT_MULTI_CORE
/**
 * \brief     Config the usage function of the selected pin.
 *
 * \param[in] Pin_Num   Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] Pin_Func  IO function of pin. Refer to \ref PIN_Function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     Pad_Config(P2_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);
 *     Pad_Config(P2_1, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);

 *     Pinmux_CODEC_Config(P2_0, UART0_TX);
 *     Pinmux_CODEC_Config(P2_1, UART0_RX);
 * }
 * \endcode
 */
void Pinmux_CODEC_Config(uint8_t Pin_Num, uint8_t Pin_Func);

/**
 * \brief  Config pin to VCORE1 domain dedicated mux.
 *
 * \param[in] Pin_Num   Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] Pin_Func  IO function of pin. Refer to \ref PIN_Function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     Pad_Config(P2_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);
 *     Pad_Config(P2_1, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE,
               PAD_OUT_HIGH);

 *     Pinmux_CODEC_Config(P2_0, DMIC1_CLK);
 *     Pinmux_CODEC_Config(P2_1, DMIC1_DAT);
 * }
 * \endcode
 */

void Pinmux_V1_Config(uint8_t Pin_Num, uint8_t Pin_Func);
#endif

#if PINMUX_SUPPORT_AON_CONFIG
/**
 * \brief  Configure the specified pin to its corresponding pin AON function
 *
 * \param[in] Pin_Func  AON function of pin. Refer to \ref PINMUX_AON_Function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     Pad_Config(XI32K, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
 *     Pinmux_AON_Config(RTC_IN_PAD_32K_XI);
 * }
 * \endcode
 */
void Pinmux_AON_Config(uint16_t Pin_Func);
#endif

#if PINMUX_SUPPORT_HS_CONFIG
/**
 * \brief  Configure the specified pin to its corresponding pin high speed function.
 *
 * \param[in] Pin_Func  High Speed function. Refer to \ref PINMUX_HS_Function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *      Pinmux_HS_Config(SPI0_HS);
 * }
 * \endcode
 */
void Pinmux_HS_Config(uint32_t Pin_Func);
#endif

/**
 * \brief     Configure the relevant operation mode,
 *            peripheral circuit and output level value in software mode of the specified pin
 *
 * \param[in] Pin_Num        Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] AON_PAD_Mode   Use software mode or pinmux mode.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_SW_MODE: pad pin is configured software mode.
 *                           \arg PAD_PINMUX_MODE: pad pin is configured pinmux mode.
 * \param[in] AON_PAD_PwrOn  Config power of pad.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_NOT_PWRON: pad is not power.
 *                           \arg PAD_IS_PWRON: pad is power on.
 * \param[in] AON_PAD_Pull   Config pad pull mode.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_PULL_NONE: Pull None.
 *                           \arg PAD_PULL_UP: Pull up.
 *                           \arg PAD_PULL_DOWN: Pull down.
 * \param[in] AON_PAD_E      Config pad out put function.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_OUT_DISABLE: Disable pin output.
 *                           \arg PAD_OUT_ENABLE: Enable pad output.
 * \param[in] AON_PAD_O      Config pin output level.
 *                           This parameter can be one of the following values:
 *                           - PAD_OUT_LOW: Pad output low level.
 *                           - PAD_OUT_HIGH: Pad output high level.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     Pad_Config(P2_0, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
 *     Pad_Config(P2_1, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_DISABLE, PAD_OUT_LOW);
 * }
 * \endcode
 */
void Pad_Config(uint8_t                 Pin_Num,
                PADMode_TypeDef         AON_PAD_Mode,
                PADPowerMode_TypeDef    AON_PAD_PwrOn,
                PADPullMode_TypeDef     AON_PAD_Pull,
                PADOutputMode_TypeDef   AON_PAD_E,
                PADOutputValue_TypeDef  AON_PAD_O);

#if PAD_SUPPORT_CONFIG_EXT
/**
 * \brief     Configure the relevant operation mode, peripheral circuit, pull resistor value and
 *            output level value in software mode of the specified pin.
 *
 * \param[in] Pin_Num        Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] AON_PAD_Mode   Use software mode or pinmux mode.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_SW_MODE: Use software mode.
 *                           \arg PAD_PINMUX_MODE: Use pinmux mode.
 * \param[in] AON_PAD_PwrOn  Config power of pad.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_SHUTDOWN: Shutdown power of pad.
 *                           \arg PAD_IS_PWRON: Enable power of pad.
 * \param[in] AON_PAD_Pull   Config pad pull mode.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_PULL_NONE: No pull.
 *                           \arg PAD_PULL_UP: Pull this pin up.
 *                           \arg PAD_PULL_DOWN: Pull this pin down.
 * \param[in] AON_PAD_E      Config pad output function, which only valid when PAD_SW_MODE.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_OUT_DISABLE: Disable pin output.
 *                           \arg PAD_OUT_ENABLE: Enable pad output.
 * \param[in] AON_PAD_O      Config pin output level, which only valid when PAD_SW_MODE and output mode.
 *                           This parameter can be one of the following values:
 *                           \arg PAD_OUT_LOW: Pad output low.
 *                           \arg PAD_OUT_HIGH: Pad output high.
 * \param[in] AON_PAD_P      Config resistor value.
 *                           This parameter can be one of the following values:
 *                           - PAD_150K_PULL: pad pull 150k resistance.
 *                           - PAD_15K_PULL: pad pull 15k resistance.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void driver_adc_init(void)
 * {
 *     Pad_ConfigExt(P2_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW, PAD_150K_PULL);
 *     Pad_ConfigExt(P2_1, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW, PAD_150K_PULL);
 * }
 * \endcode
 */
extern void Pad_ConfigExt(uint8_t Pin_Num,
                          PADMode_TypeDef AON_PAD_Mode,
                          PADPowerMode_TypeDef AON_PAD_PwrOn,
                          PADPullMode_TypeDef AON_PAD_Pull,
                          PADOutputMode_TypeDef AON_PAD_E,
                          PADOutputValue_TypeDef AON_PAD_O,
                          PADPullStrengthMode_TypeDef AON_PAD_P);
#endif

#if PAD_SUPPORT_DEDICATE_CONFIG
/**
 * \brief     Config the corresponding pad dedicated function.
 *
 * \param[in] Pin_Num  Pin number to be configured.
 *                     This parameter is specific to certain Pins that support dedicated IO.
 * \param[in] Status   Enable or disable the pad dedicate dedicated function.
 *                     - ENABLE: Enable the pad dedicated function.
 *                     - DISABLE: Disable the pad dedicated function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_adc_init(void)
 * {
 *     Pad_Dedicated_Config(P2_2, Enable);
 * }
 * \endcode
 */
void Pad_Dedicated_Config(uint8_t Pin_Num, FunctionalState Status);
#endif

#if PAD_SUPPORT_CONFIG_DEFAULT
/**
 * \brief   Set all pins to the default state.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_AllConfigDefault();
 * }
 * \endcode
 */
extern void Pad_AllConfigDefault(void);
#endif

#if PAD_SUPPORT_WAKEUP_MULTI_GROUP
bool System_WakeUpDebounceMultiGroupEnable(uint8_t Pin_Num);
bool System_WakeUpDebounceMultiGroupDisable(uint8_t Pin_Num);
#endif

/**
 * \brief     Enable the function of the wake-up system of the specified pin.
 *
 * \param[in] Pin_Num     Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] Polarity    Polarity of wake-up system.
 *                        This parameter can be the following:
 *                        \arg PAD_WAKEUP_POL_HIGH: Use high level wake-up polarity.
 *                        \arg PAD_WAKEUP_POL_LOW: Use low level wake-up polarity.
 * \param[in] DebounceEn  Enable delay function.
 *                        - PAD_WK_DEBOUNCE_DISABLE: Disable wake-up debounce function.
 *                        - PAD_WK_DEBOUNCE_ENABLE: Enable wake-up debounce function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * //IO enter dlps call back function.
 * void io_uart_dlps_enter(void)
 * {
 *     // Switch pad to software mode
 *     Pad_ControlSelectValue(P2_0, PAD_SW_MODE);//tx pin
 *     Pad_ControlSelectValue(P2_1, PAD_SW_MODE);//rx pin
 *
 *     System_WakeUpPinEnable(P2_1, PAD_WAKEUP_POL_LOW, PAD_WK_DEBOUNCE_DISABLE);
 * }
 * \endcode
 */
void System_WakeUpPinEnable(uint8_t Pin_Num, uint8_t Polarity, uint8_t DebounceEn);

/**
 * \brief     Disable the function of the wake-up system of the specified pin.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * #define UART_RX_PIN                P4_1
 *
 * //System interrupt handler function, for wake-up pin.
 * void System_Handler(void)
 * {
 *     if (System_WakeUpInterruptValue(UART_RX_PIN) == SET)
 *     {
 *         Pad_ClearWakeupINTPendingBit(UART_RX_PIN);
 *         System_WakeUpPinDisable(UART_RX_PIN);
 *         //Add user code here.
 *     }
 * }
 * \endcode
 */
void System_WakeUpPinDisable(uint8_t Pin_Num);

/**
 * \brief   Get pin interrupt status.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return Interrupt status.
 *         - 1: Pin wake up interrupt status is true.
 *         - 0: Pin wake up interrupt status is false.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * #define UART_RX_PIN                P4_1
 *
 * //System interrupt handler function, for wakeup pin.
 * void System_Handler(void)
 * {
 *     if (System_WakeUpInterruptValue(UART_RX_PIN) == SET)
 *     {
 *         Pad_ClearWakeupINTPendingBit(UART_RX_PIN);
 *         System_WakeUpPinDisable(UART_RX_PIN);
 *         //Add user code here.
 *     }
 * }
 * \endcode
 */
uint8_t System_WakeUpInterruptValue(uint8_t Pin_Num);

/**
 * \brief  Enable or disable wake-up debounce function.
 *
 * \param[in] Pin_Num               Pin number to be configured. Refer to \ref Pin_Number.
 * \note                            Pin_Num is invalid parameter for rtl87x2g series so that any pin can be filled in.
 * \param[in] PADWakeupCmd_TypeDef  Wake-up system enable or disable
 *                                  - PAD_WAKEUP_DISABLE: Disable wake-up function.
 *                                  - PAD_WAKEUP_DISABLE: Enable wake-up function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 *void System_WakeUpPinEnable(uint8_t Pin_Num, uint8_t Polarity, uint8_t DebounceEn)
 *{
 *    if(Pin_Num >= MAX_PIN_NUM)
 *    {
 *        return;
 *    }
 *
 *    Pad_SetWakeupPolarity(Pin_Num, Polarity);
 *    Pad_WakeupDebounce_Cmd(Pin_Num, DebounceEn);
 *    if (PAD_WAKEUP_DEB_ENABLE == DebounceEn)
 *    {
 *        System_WakeUpDebounceCmd(Pin_Num, PAD_WAKEUP_ENABLE);
 *    }
 *    Pad_Wakeup_Cmd(Pin_Num, ENABLE);
 *}
 * \endcode
 */
void System_WakeUpDebounceCmd(uint8_t Pin_Num, PADWakeupCmd_TypeDef Status);

/**
 * \brief   Config wake up system debounce time.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \note               Pin_Num is invalid parameter for rtl87x2g series so that any pin can be filled in.
 * \param[in] time_ms  Debounce time. Unit: ms.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     System_WakeUpDebounceTime(10);
 * }
 * \endcode
 */
void System_WakeUpDebounceTime(uint8_t Pin_Num, uint8_t time_ms);

/**
 * \brief   Config wake up system debounce time.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \note               Pin_Num is invalid parameter for rtl87x2g series so that any pin can be filled in.
 * \param[in] time_us  Debounce time. Unit: us.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     System_WakeUpDebounceTimeUs(1000);
 * }
 * \endcode
 */
void System_WakeUpDebounceTimeUs(uint8_t Pin_Num, uint8_t time_us);

/**
 * \brief  Get debounce wake up status.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \note               Pin_Num is invalid parameter for rtl87x2g series so that any pin can be filled in.
 *
 * \return Debounce wakeup status.
 *         - 1: Pin debounce wakeup status is true.
 *         - 0: Pin debounce wakeup status is false.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     uint8_t WakeupDebounceStatus = System_WakeupDebounceStatus;
 * }
 * \endcode
 */

uint8_t System_WakeupDebounceStatus(uint8_t Pin_Num);

/**
 * \brief  Clear debounce wake up status. Call this API will clear the debunce wakeup status bit.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \note               Pin_Num is invalid parameter for rtl87x2g series so that any pin can be filled in.
 *
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void dlps_store(void)
 * {
 *     System_WakeupDebounceClear(P0_0);
 * }
 * \endcode
 */
void System_WakeupDebounceClear(uint8_t Pin_Num);

/**
 * \brief     Configure the driving current.
 *
 * \param[in] Pin_Num              Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] PAD_Driving_Current  This parameter sets the driving current.
 *                                 Refer to \ref PADDrivingCurrent_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_SetDrivingCurrent(P2_0, PAD_DRIVING_CURRENT_4mA);
 * }
 * \endcode
 */
void Pad_SetDrivingCurrent(uint8_t Pin_Num, PADDrivingCurrent_TypeDef PAD_Driving_Current);

/**
 * \brief     Set pin control mode.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] value    This parameter sets the pin mode.
 *                     This parameter can be the following:
 *                     - PAD_SW_MODE: Software mode.
 *                     - PAD_PINMUX_MODE: Pinmux mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_SetControlMode(P2_0, PAD_SW_MODE);
 * }
 * \endcode
 */
void Pad_SetControlMode(uint8_t Pin_Num, PADMode_TypeDef PAD_Mode);

/**
 * \brief     Enable or disable pad output mode.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] value    This parameter sets whether the pin outputs the level in software mode.
 *                     This parameter can be enumerated \ref PAD_Output_Config of the values:
 *                     - PAD_OUT_DISABLE: Disable output.
 *                     - PAD_OUT_ENABLE: Enable output.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void pad_demo(void)
 * {
 *     Pad_OutputEnableValue(P2_0, PAD_OUT_ENABLE);
 * }
 * \endcode
 */
void Pad_OutputCmd(uint8_t Pin_Num, PADOutputMode_TypeDef Status);

/**
 * \brief     Configure pad output level.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] value    Config pin output level.
 *                     This parameter can be one of the following values:
 *                     - PAD_OUT_LOW: Pad output low.
 *                     - PAD_OUT_HIGH: Pad output high.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_OutputControlValue(P2_0, PAD_OUT_HIGH);
 * }
 * \endcode
 */
void Pad_SetOutputLevel(uint8_t Pin_Num, uint8_t value);

/**
 * \brief     Enable or disable pad pull resistance.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] value    This parameter enable or disable the the pad pin pull resistance.
 *                     This parameter can be the following value:
 *                     - DISABLE: Disable pad pull function.
 *                     - ENABLE: Enable  pad pull function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_PullEnableValue(P2_0, ENABLE);
 * }
 * \endcode
 */
void Pad_PullCmd(uint8_t Pin_Num, FunctionalState Status);

/**
 * \brief     Pad pull-up/pull-down resistance function selection.
 *
 * \param[in] Pin_Num        Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] PAD_Pull_Mode  Config pad pull mode.
 *                           This parameter can be the following values, refer to \ref PAD_Pull_Mode.
 *                           - PAD_PULL_NONE: No pull.
 *                           - PAD_PULL_UP: Pull this pin up
 *                           - PAD_PULL_DOWN: Pull this pin down.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_PullUpOrDownValue(P2_0, 1);
 * }
 * \endcode
 */
void Pad_SetPullMode(uint8_t Pin_Num, PADPullMode_TypeDef PAD_Pull_Mode);

/**
 * \brief     Configure the strength of pull-up/pull-down resistance.
 *
 * \param[in] Pin_Num                 Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] PAD_Pull_Strength_Mode  This parameter sets the strength of pull-up/pull-down resistance.
 *                                    This parameter can be the following values, refer to \ref PAD_Pull_Strength_Mode.
 *                                    - PAD_PULL_WEAK: Resistance weak pull.
 *                                    - PAD_PULL_STRONG: Resistance strong pull.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_PullConfigValue(P2_0, PAD_PULL_STRONG);
 * }
 * \endcode
 */
void Pad_SetPullStrength(uint8_t Pin_Num, PADPullStrengthMode_TypeDef PAD_Pull_Strength_Mode);

