yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/pinmux/inc/rtl_pinmux.h
/**
 * \brief     Set pin power mode.
 *
 * \param[in] Pin_Num   Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] PWR_Mode  Config power of pad.
 *                      This parameter can be the following values, refer to \ref PAD_Power_Mode.
 *                      - PAD_NOT_PWRON: Power off.
 *                      - PAD_IS_PWRON: Power on.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_PowerOrShutDownValue(P2_0, PAD_NOT_PWRON);
 * }
 * \endcode
 */
void Pad_PowerCmd(uint8_t Pin_Num, PADPowerMode_TypeDef PWR_Mode);

/**
 * \brief     Clear the interrupt pending bit of the specified pin.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_ClearWakeupINTPendingBit(P2_0);
 * }
 * \endcode
 */
void Pad_ClearWakeupINTPendingBit(uint8_t Pin_Num);

/**
 * \brief     Clear all wake up pin interrupt pending bit.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_ClearAllWakeupINT();
 * }
 * \endcode
 */
void Pad_ClearAllWakeupINT(void);

/**
 * \brief  Short pulse wakeup function.
 *
 * \param[in] Status  PAD_SHORT_PULSE_WAKEUP_DISABLE or PAD_SHORT_PULSE_WAKEUP_ENABLE.
 *                    This parameter refer to \ref PAD_SHORT_PULSE_WAKEUP_EN.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     Pad_ShortPulseWakeUpCmd(PAD_SHORT_PULSE_WAKEUP_ENABLE);
 * }
 * \endcode
 */

void Pad_ShortPulseWakeUpCmd(PADSPWakeupCmd_TypeDef Status);

#if PAD_SUPPORT_AON_WAKEUP
/**
 * \brief  Get aon wake up int.
 *
 * \return  Wakeup intterupt.
 *          - bit0: aon pad wake up int
 *          - bit1: aon lpc0 wake up int
 *          - bit2: aon lpc1 wake up int
 *          - bit3: aon qdec wake up int
 *          - bit4: aon vadbuf wake up int
 *          - bit5: aon vad wake up int
 *          - bit6: aon usb wake up int
 *          - bit7: aon rtc wake up int
 *          - bit8: aon pf rtc wake up int
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     get_aon_wakeup_int();
 * }
 * \endcode
 */

uint32_t get_aon_wakeup_int(void);

/**
 * \brief  Clear aon wake up int.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void board_xxx_init(void)
 * {
 *     clear_aon_wakeup_int();
 * }
 * \endcode
 */
void clear_aon_wakeup_int(void);
#endif

#if PAD_SUPPORT_GET_OUTPUT_CTRL
/**
 * \brief   Get pad current output/input setting.
 *
 * \param[in] Pin_Num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return   Refer to \ref PAD_AON_Status.
 *           - PAD_AON_OUTPUT_LOW: Pad AON output low level.
 *           - PAD_AON_OUTPUT_HIGH: Pad AON output high level.
 *           - PAD_AON_OUTPUT_DISABLE: Pad AON output disable.
 *           - PAD_AON_PINMUX_ON: Pad AON pinmux on.
 *           - PAD_AON_PIN_ERR: Pad AON pin error.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void pad_demo(void)
 * {
 *     if (Pad_GetOutputCtrl(P2_1) == PAD_AON_OUTPUT_LOW)
 *     {
 *         //Add user code here.
 *     }
 * }
 * \endcode
 */
uint8_t Pad_GetOutputCtrl(uint8_t Pin_Num);
#endif

#if PAD_SUPPORT_GET_POWER_GROUP
/**
 * \brief   Get the pin power group.
 *
 * \param[in] pin  pin of set only VDDIO pin.
 *
 * \return   get the power group of the pin. Please refer to \ref PAD_Power_Group.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void pad_demo(void)
 * {
 *     Pad_GetPowerGroup(P2_1);
 * }
 * \endcode
 */
T_PIN_POWER_GROUP  Pad_GetPowerGroup(uint8_t pin);
#endif

#if PAD_SUPPORT_GET_PIN_NAME
/**
 * \brief   Get the pin name in string.
 *
 * \param[in] pin_num  Pin number to be configured. Refer to \ref Pin_Number.
 *
 * \return   pin name or null.
 *           - pin name
 *           - null due to invalid pin index.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void pad_demo(void)
 * {
 *     Pad_GetPinName(P2_1);
 * }
 * \endcode
 */
const char *Pad_GetPinName(uint8_t pin_num);
#endif

#if PAD_SUPPORT_ANALOG_MODE
/**
 * \brief   Config Hybrid pad analog/digital functions.
 *
 * \param[in] pin   Pin number to be configured. Refer to \ref Pin_Number.
 * \param[in] mode  Please refer to \ref Pad_ANA_Mode.
 *                  This parameter can be: PAD_ANALOG_MODE/PAD_DIGITAL_MODE.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void pad_demo(void)
 * {
 *     Pad_AnalogMode(P2_1, PAD_ANALOG_MODE);
 * }
 * \endcode
 */
void Pad_AnalogMode(uint8_t pin, ANA_MODE mode);
#endif

#if (PAD_SUPPORT_ADPATER_WAKEUP | PAD_SUPPORT_MFB_WAKEUP)
/**
 * \brief   Config the system wakeup mode.
 *
 * \param[in] mode      Mode of set, this parameter can refer to \ref WakeUp_EN_Mode.
 *                      This parameter can be one of the following values:
 *                      \arg ADP_MODE: Wake up by adapter.
 *                      \arg BAT_MODE: Wake up by battery.
 *                      \arg MFB_MODE: Wake up by MFB.
 *                      \arg USB_MODE: Wake up by USB.
 * \param[in] pol       Polarity to wake up.
 *                      This parameter can be one of the following values:
 *                      \arg POL_HIGH: Use high level wakeup.
 *                      \arg POL_LOW: Use low level wakeup.
 * \param[in] NewState  Enable or disable wake up.
 *                      This parameter can be one of the following values:
 *                      \arg ENABLE: Enable the system wake up at specified polarity.
 *                      \arg DISABLE: Disable the system wake up at specified polarity.
 *
 * \return     Config the system wakeup mode fail or success.
 *             - 0: Config success.
 *             - 1: Config fail due to wrong mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void adapter_wake_up_enable(void)
 * {
 *     //adapter mode is WAKE_UP_GENERAL
 *     Pad_WakeUpConfig(ADP_MODE, POL_HIGH, ENABLE);
 * }
 * \endcode
 */
uint8_t  Pad_WakeUpCmd(WAKEUP_EN_MODE mode, WAKEUP_POL pol, FunctionalState NewState);
#endif

#if PAD_SUPPORT_ADPATER_WAKEUP
/**
 * \brief   Configure the adpater wake-up system functions in power off(shipping) mode.
 *
 * \param[in] NewState  Enable or disable adpater wake up.
 *                      This parameter can be one of the following values:
 *                      \arg ENABLE: Enable adpater wake up system at specified polarity.
 *                      \arg DISABLE: Disable adpater wake up system.
 * \param[in] pol       Polarity to wake up.
 *                      This parameter can be one of the following values:
 *                      - POL_HIGH: Use high level wakeup.
 *                      - POL_LOW: Use low level wakeup.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void adapter_wake_up_enable(void)
 * {
 *     //adapter mode is wake_up_power_off
 *     System_SetAdpWakeUpFunction(ENABLE, POL_HIGH);
 * }
 * \endcode
 */
void System_SetAdpWakeUpFunction(FunctionalState NewState, WAKEUP_POL pol);
#endif

#if PAD_SUPPORT_MFB_WAKEUP
/**
 * \brief   Configure the MFB wake-up system functions in power off(shipping) mode.
 *
 * \param[in] NewState  Enable or disable MFB wake up.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable MFB wake up system.
 *                      - DISABLE: Disable MFB wake up system.
 *
 * <b>Example usage</b>
 * \code{.c}
 * //io_test_set_mfb_mode is POWER_OFF_WAKEUP_TEST
 * void mfb_wake_up_enable(void)
 * {
 *     System_SetMFBWakeUpFunction(ENABLE);
 * }
 * \endcode
 */
void System_SetMFBWakeUpFunction(FunctionalState NewState);
#endif

/** End of PINMUX_Exported_Functions
  * \}
  */

/** End of PINMUX
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_PINMUX_H */


